CSmoothStopTransition.Create(IUIAnimationTransitionLibrary*,IUIAnimationTransitionFactory*)
Calls the transition library to create encapsulated transition COM object.
Returns:
TRUE if transition is created successfully; otherwise FALSE.
pLibrary: A pointer to transition library, which is responsible for creation of standard transitions.
pFactory: A pointer to transition factory, which is responsible for creation of custom transitions.

CSmoothStopTransition.m_dblFinalValue
The value of the animation variable at the end of the transition.

CSmoothStopTransition.m_maximumDuration
The maximum duration of the transition.

CSmoothStopTransition.#ctor(System.Double,System.Double)
Constructs a smooth-stop transition and initializes its maximum duration and final value.
maximumDuration: The maximum duration of the transition.
dblFinalValue: The value of the animation variable at the end of the transition.

CSmoothStopTransition
Encapsulates a smooth-stop transition.
Remarks:
A smooth-stop transition slows down as it approaches a given final value, and reaches it with a velocity of zero.
The duration of the transition is determined by the initial velocity, the difference between the initial and final values,
and the specified maximum duration. If there is no solution consisting of a single parabolic arc,
this method creates a cubic transition.
Because all transitions are cleared automatically, it's recommended to allocated them using operator new.
The encapsulated IUIAnimationTransition COM object is created by CAnimationController::AnimateGroup, until then
it's NULL. Changing member variables after creation of this COM object has no effect.